Revit 2027 API
GeometryElement.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<GeometryObject> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of GeometryObject)
public:
virtual IEnumerator<GeometryObject^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<GeometryObject>
override GetEnumerator : unit -> IEnumerator<GeometryObject>
Return Value
IEnumerator<GeometryObject>
An IEnumerator(GeometryObject) object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace